InformationRegisters/ДМ_EDIКлиенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>ДМ_EDIКлиенты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>FTPСервер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДМ_ПараметрыПодключенияFTP</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДМ_ГлобальныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ДМ_EDIКлиенты/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервереБезКонтекста
Функция ПолучитьСписокЛистов_EXCEL1C(Знач ФайлEXCEL)
	Перем ТабличныйДокумент, ОбластьТД;
	Перем СписокЛистов;
	
	СписокЛистов = Новый СписокЗначений;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	Попытка
		ТабличныйДокумент.Прочитать(ФайлEXCEL);
	Исключение
		ТекстОшибки = ОписаниеОшибки();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		Возврат Новый СписокЗначений;
	КонецПопытки;
	
	Для Каждого ОбластьТД ИЗ ТабличныйДокумент.Области Цикл
		СписокЛистов.Добавить(ОбластьТД.Имя);
	КонецЦикла;
	
	Возврат СписокЛистов;
	
КонецФункции

&НаСервереБезКонтекста
Функция ЕстьЗаписи()
	
	ВыборкаРС = РегистрыСведений.ДМ_EDIКлиенты.Выбрать();	
	Возврат ВыборкаРС.Следующий();
	
КонецФункции	

&НаСервереБезКонтекста
Процедура ОчиститьРегистр()
	
	НаборЗаписей = РегистрыСведений.ДМ_EDIКлиенты.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать();
	
КонецПроцедуры	

&НаСервереБезКонтекста
Функция КвоЗаписейВРегистре()
	
	НаборЗаписей = РегистрыСведений.ДМ_EDIКлиенты.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	
	Возврат НаборЗаписей.Количество();
	
КонецФункции

&НаКлиенте
Процедура ЗагрузитьДанныеИзФайла(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		//очистить регистр и выполнить загрузку
		ОчиститьРегистр();	
	Иначе	
		Возврат;
	КонецЕсли;	
	
	пРежимДиалогаВыбораФайла = РежимДиалогаВыбораФайла.Открытие;
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(пРежимДиалогаВыбораФайла);
	
	Попытка
		ДиалогВыбораФайла.Заголовок = "Укажите файл для загрузки в регистр сведений EDI-Клиенты ";
		ДиалогВыбораФайла.Фильтр = "Файл MS Excel|*.xls;*.xlsx";
		ДиалогВыбораФайла.МножественныйВыбор = Ложь;
		ДиалогВыбораФайла.ПолноеИмяФайла = ""; 
		
		Если Не ДиалогВыбораФайла.Выбрать() Тогда
			
			Возврат;
			
		Иначе
			
			ИмяФайла = ДиалогВыбораФайла.ВыбранныеФайлы[0];
			
		КонецЕсли;	
		
	Исключение
		
		ТекстОшибки = ОписаниеОшибки();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		
	КонецПопытки;
	
	ДиалогВыбораФайла = Неопределено;
	
	Если ЗначениеЗаполнено(ИмяФайла) Тогда
		Двоичное = Новый ДвоичныеДанные(ИмяФайла);
		Адрес = ПоместитьВоВременноеХранилище(Двоичное, ЭтаФорма.УникальныйИдентификатор);
		КраткоеИмяФайла = "";
		ДлФ = СтрДлина(ИмяФайла);
		Пока ДлФ > 0 Цикл
			ТекСимв = Сред(ИмяФайла,ДлФ,1);
			Если ТекСимв = "\" Или ТекСимв = "/" Тогда
				Прервать;
			КонецЕсли;
			КраткоеИмяФайла = ТекСимв + КраткоеИмяФайла;
			ДлФ=ДлФ-1;	
		КонецЦикла;
		ЗагрузитьИзEXCELНаСервере(Адрес,КраткоеИмяФайла);
	КонецЕсли;
	
	Элементы.Список.Обновить();
	
КонецПроцедуры	

&НаКлиенте
Процедура ЗагрузитьИзEXCEL(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ЗагрузитьДанныеИзФайла", ЭтотОбъект);
	
	Если КвоЗаписейВРегистре() > 0  Тогда
		ПоказатьВопрос(Оповещение, "Перед загрузкой текущие данные будут очищены. Продолжить ?", РежимДиалогаВопрос.ДаНетОтмена, 0);
	Иначе
		ПоказатьВопрос(Оповещение, "Загрузить данные из файла. Продолжить ?", РежимДиалогаВопрос.ДаНетОтмена, 0);
	КонецЕсли;	
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗагрузитьИзEXCELНаСервере(Адрес,КраткоеИмяФайла)
	
	темп_Путь = КаталогВременныхФайлов() + КраткоеИмяФайла;
	темп_файл = ПолучитьИзВременногоХранилища(Адрес);
	темп_файл.Записать(темп_Путь);
	
	СписокЛистов = ПолучитьСписокЛистов_EXCEL1C(темп_Путь);
	
	Если СписокЛистов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;	
	
	ТаблДок = Новый ТабличныйДокумент;
	Попытка
		ТаблДок.Прочитать(темп_Путь);    
	Исключение
		ТекстОшибки = ОписаниеОшибки();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		Возврат;
	КонецПопытки;
	
	ИмяЛиста = СписокЛистов[0].Значение;
	
	ОбластьФайла = ТаблДок.ПолучитьОбласть(ИмяЛиста);
	КолВоСтрокФайла = ОбластьФайла.ПолучитьРазмерОбластиДанныхПоВертикали();
	КолВоКолонокФайла = ОбластьФайла.ПолучитьРазмерОбластиДанныхПоГоризонтали();
	НачСтрока = 1;
	
	ТЗ = ДМ_РаботаСФайламиEXCEL1С.ЗагрузитьМетодом_EXCEL1C(темп_Путь,ИмяЛиста,0,НачСтрока);
	
	Если ТЗ.Количество() > (НачСтрока - 1) Тогда
		
		КвоНов = 0;
		КвоОбр = 0;
		Для нс = (НачСтрока-1) по ТЗ.Количество()-1 Цикл
			ТекТЗ = ТЗ.Получить(нс);
			ТекGLNСети = ТекТЗ["N1"];
			ТекFTPСервер = ТекТЗ["N2"];
			
			Если Не ЗначениеЗаполнено(ТекGLNСети) Тогда 
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан код GLN сети встроке файла № " + (нс+1) + ". Загрузка прервана");
				Продолжить;
			КонецЕсли;
			ИскFTP = Справочники.ДМ_ПараметрыПодключенияFTP.ПустаяСсылка();
			Если Не ПустаяСтрока(ТекFTPСервер) Тогда
				ИскFTP = Справочники.ДМ_ПараметрыПодключенияFTP.НайтиПоНаименованию(ТекFTPСервер,Истина);
				Если ИскFTP = Справочники.ДМ_ПараметрыПодключенияFTP.ПустаяСсылка() Тогда
					Сообщить("Не найден FTP сервер по наименованию " + ТекFTPСервер + ", строка файла № " + (нс+1));
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			
			СЗ = РегистрыСведений.ДМ_EDIКлиенты.СоздатьНаборЗаписей();
			СЗ.Отбор.ДМ_ГлобальныйНомер.Установить(ТекGLNсети);
			СЗ.Прочитать();
			Если СЗ.Количество() = 0 Тогда
				НЗ = РегистрыСведений.ДМ_EDIКлиенты.СоздатьНаборЗаписей();
				НЗ.Отбор.ДМ_ГлобальныйНомер.Установить(ТекGLNсети);
				НовЗапись = НЗ.Добавить();
				НовЗапись.ДМ_ГлобальныйНомер = ТекGLNСети;
				НовЗапись.FTPСервер = ИскFTP;
				НЗ.Записать();
				КвоНов = КвоНов + 1;
			Иначе
				ТекЗапись = СЗ.Получить(0);
				Если ТекЗапись.FTPСервер <> ИскFTP Тогда
					ТекЗапись.FTPСервер = ИскFTP;
					КвоОбр = КвоОбр + 1;
					СЗ.Записать();	
				КонецЕсли;	
			КонецЕсли;	
		КонецЦикла;	
		
		Если КвоНов > 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Загружено " + КвоНов + " записей");
		КонецЕсли;		
		Если КвоОбр > 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Обновлено " + КвоОбр + " записей");
		КонецЕсли;		
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
	КонецЕсли;	
	
	Попытка
		УдалитьФайлы(темп_Путь); 
	Исключение
		ТекстОшибки = ОписаниеОшибки();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		Возврат;
	КонецПопытки;	
	
	Попытка
		УдалитьФайлы(темп_Путь); 
	Исключение
		ТекстОшибки = ОписаниеОшибки();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		Возврат;
	КонецПопытки;
	
КонецПроцедуры
